insert into library.public.authors (name)
values ('Джоан Роулинг'),
       ('Наполеон Хилл'),
       ('Адитья Бхаргава'),
       ('Джордж Оруэлл');

insert into library.public.genres (name)
values ('фэнтези'),
       ('саморазвитие'),
       ('бизнес и финансы'),
       ('информационные технологии'),
       ('классика'),
       ('для мужчин'),
       ('красота и здоровье'),
       ('автомобили'),
       ('спорт'),
       ('еженедельные'),
       ('кулинария'),
       ('ежемесячные'),
       ('охота и рыбалка');

insert into library.public.publishers (name)
values ('Махаон'),
       ('Попурри'),
       ('Питер'),
       ('Азбука'),
       ('Шкулёв Медиа Холдинг'),
       ('Бренд Комьюнити Медиа'),
       ('Открытые Системы'),
       ('Советский спорт'),
       ('Спорт-Экспресс'),
       ('С-медиа'),
       ('Бергес');

insert into library.public.books (name, publication_date, publisher_id)
values ('Гарри Поттер и философский камень', '2016-01-01', 1),
       ('Гарри Поттер и Тайная комната', '2019-01-01', 1),
       ('Гарри Поттер и узник Азкабана', '2016-01-01', 1),
       ('Гарри Поттер и Кубок огня', '2019-01-01', 1),
       ('Думай и богатей', '2022-02-02', 2),
       ('Грокаем алгоритмы', '2019-03-03', 3),
       ('Скотный двор', '2022-04-04', 4);

insert into library.public.magazines (name, publication_date, publisher_id)
values ('MAXIM', '2022-03-31', 5),
       ('АВТОМИР', '2019-06-27', 6),
       ('АВТОМИР. ТЕСТ-ДРАЙВ', '2018-09-20', 6),
       ('COMPUTERWORLD', '2018-03-27', 7),
       ('СОВЕТСКИЙ СПОРТ. ФУТБОЛ', '2022-11-08', 8);

insert into library.public.newspapers (name, publication_date, publisher_id)
values ('СПОРТ-ЭКСПРЕСС', '2022-11-14', 9),
       ('ЕДА НА УРА', '2018-05-10', 10),
       ('ОХОТНИК И РЫБОЛОВ. ГАЗЕТА ДЛЯ ДУШИ', '2021-10-12', 11);

insert into library.public.books_authors
values (1, 1),
       (2, 1),
       (3, 1),
       (4, 1),
       (5, 2),
       (6, 3),
       (7, 4);

insert into library.public.books_genres
values (1, 1),
       (2, 1),
       (3, 1),
       (4, 1),
       (5, 2),
       (5, 3),
       (6, 4),
       (7, 1),
       (7, 5);

insert into library.public.magazines_genres
values (1, 6),
       (1, 7),
       (2, 6),
       (2, 8),
       (3, 6),
       (3, 8),
       (4, 4),
       (5, 6),
       (5, 7),
       (5, 9);

insert into library.public.newspapers_genres
values (1, 6),
       (1, 9),
       (1, 10),
       (2, 11),
       (2, 12),
       (3, 6),
       (3, 12),
       (3, 13);